package example;

public class IfExample {
	public static void main(String[] args) {
		//문자변수에 저장된 문자값을 출력하세요.
		//단, 저장된 문자값이 알파벳 소문자인 경우 대문자로 변환하여 출력하세요.
		char mun='x';

		
		System.out.println("============================================");
		
		//정수변수에 저장된 정수값이 4의 배수인지 아닌지를 구분하여 출력하세요.
		int num=345644;

		
		System.out.println("============================================");
		
		//올해가 평년인지 윤년인지를 구분하여 출력하세요.
		// => 년도를 4로 나누어 나머지가 0인 경우 윤년
		// => 위 조건을 만족하는 년도 중 100으로 나누어 나머지가 0인 경우 평년
		// => 위 조건들을 만족하는 년도 중 400으로 나누어 나머지가 0인 경우 윤년
		int year=2019;
		
		
		System.out.println("============================================");
		
		//이름이 "홍길동"인 학생의 시험성적은 국어 87점, 영어 93점, 수학 80점입니다.
		//학생의 시험성적에 대한 총점과 평균, 평균에 대한 학점을 계산하여 
		//이름, 총점, 평균, 학점을 출력하세요.
		// => 국어, 영어, 수학 점수 중 하나라도 0~100 범위가 아닌 경우 프로그램 종료 : System.exit(0);
		// => 평균에 대한 학점 : 100~90:A, 89~80:B, 79~70:C, 69~60:D, 59~0:F
		// => 평균은 소숫점 2자리까지만 출력되도록 하고 나머지를 내림처리 하세요.


		System.out.println("============================================");
	}
}







